In [107]:
import pandas as pd
import numpy as np

In [108]:
veri = {"ıstanbul" : [30,29,np.nan],"ankara" : [20,np.nan,25],"izmir" : [40,39,38]}
havaDurumuDataFrame = pd.DataFrame(veri)

In [109]:
havaDurumuDataFrame

   ıstanbul  ankara  izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [110]:
newVeri = {"ıstanbul" : [30,29,np.nan],"ankara" : [20,np.nan,25],"izmir" : [40,39,38],"antalya" : [45,np.nan,np.nan]}
havaDurumuDataFrame0 = pd.DataFrame(newVeri)

In [111]:
havaDurumuDataFrame0

   ıstanbul  ankara  izmir  antalya
0      30.0    20.0     40     45.0
1      29.0     NaN     39      NaN
2       NaN    25.0     38      NaN

# groupby

In [112]:
newVeri = {"departman" : ["yazılım","yazılım","pazarlama","pazarlama","hukuk","hukuk"],
           "isim" : ["ali,","veli","kemal","atil","benj","emre"],
           "maas" : [4000,3900,3800,9000,6300,3560],}

In [113]:
newVeriDataFrame = pd.DataFrame(newVeri)

In [114]:
newVeriDataFrame

   departman   isim  maas
0    yazılım   ali,  4000
1    yazılım   veli  3900
2  pazarlama  kemal  3800
3  pazarlama   atil  9000
4      hukuk   benj  6300
5      hukuk   emre  3560

In [115]:
departmanGroup = newVeriDataFrame.groupby("departman")

In [116]:
departmanGroup.count()

           isim  maas
departman
hukuk         2     2
pazarlama     2     2
yazılım       2     2

In [117]:
departmanGroup.mean()

             maas
departman
hukuk      4930.0
pazarlama  6400.0
yazılım    3950.0

In [118]:
departmanGroup.describe()

           maas
          count    mean          std     min     25%     50%     75%     max
departman
hukuk       2.0  4930.0  1937.472580  3560.0  4245.0  4930.0  5615.0  6300.0
pazarlama   2.0  6400.0  3676.955262  3800.0  5100.0  6400.0  7700.0  9000.0
yazılım     2.0  3950.0    70.710678  3900.0  3925.0  3950.0  3975.0  4000.0

In [119]:
departmanGroup.max()

            isim  maas
departman
hukuk       emre  6300
pazarlama  kemal  9000
yazılım     veli  4000

In [120]:
sozluk1 = {"isim":["ahmet","mehmet","anıl","kemal"],
           "spor":["koşu","basketntbol","futbol","yüzme"],
            "kalori":[100,200,300,250]
           }

In [121]:
dataFrame1 = pd.DataFrame(sozluk1 , index=[0,1,2,3])

In [122]:
sozluk2 = {"isim":["osman","levent","fatma","benj"],
           "spor":["koşu","bedminton","futbol","yüzme"],
            "kalori":[200,200,300,550]
           }

In [123]:
sozluk3 = {"isim":["mahmut","fatih","hakan","mehmet"],
           "spor":["tenis","basketntbol","futbol","gym"],
            "kalori":[150,320,300,450]
           }

In [124]:
dataFrame2 = pd.DataFrame(sozluk2 , index=[4,5,6,7])

In [125]:
dataFrame3 = pd.DataFrame(sozluk3 , index=[8,9,10,11])

In [126]:
dataFrame1

     isim         spor  kalori
0   ahmet         koşu     100
1  mehmet  basketntbol     200
2    anıl       futbol     300
3   kemal        yüzme     250

In [127]:
pd.concat([dataFrame1,dataFrame2,dataFrame3])

      isim         spor  kalori
0    ahmet         koşu     100
1   mehmet  basketntbol     200
2     anıl       futbol     300
3    kemal        yüzme     250
4    osman         koşu     200
5   levent    bedminton     200
6    fatma       futbol     300
7     benj        yüzme     550
8   mahmut        tenis     150
9    fatih  basketntbol     320
10   hakan       futbol     300
11  mehmet          gym     450

In [134]:
newVeriMerg = {"departman" : ["yazılım","yazılım","pazarlama","pazarlama","hukuk","hukuk"],
           "isim" : ["ali,","veli","kemal","atil","benj","emre"],
           "maas" : [4000,3900,3800,9000,6300,3560],}

In [135]:
newVeriMerg2 = {"isim":["ali,","veli","kemal","atil","benj","emre"],
           "spor":["koşu","bedminton","futbol","yüzme","saoun","asdas"],
            "kalori":[200,200,300,550,200,300]
           }

In [136]:
dataFrameMerg = pd.DataFrame(newVeriMerg)

In [137]:
dataFrameMerg1 = pd.DataFrame(newVeriMerg2)

In [141]:
a=pd.merge(dataFrameMerg,dataFrameMerg1,on="isim")
a

   departman   isim  maas       spor  kalori
0    yazılım   ali,  4000       koşu     200
1    yazılım   veli  3900  bedminton     200
2  pazarlama  kemal  3800     futbol     300
3  pazarlama   atil  9000      yüzme     550
4      hukuk   benj  6300      saoun     200
5      hukuk   emre  3560      asdas     300

In [142]:
a.size

30

In [144]:
a["maas"] * 2

0     8000
1     7800
2     7600
3    18000
4    12600
5     7120
Name: maas, dtype: int64